
 Model Name: DNN_mymod4 
 Number of periods: 17 
 Number of nodes: [150, 80, 15, 5] 
 
Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dropout_80 (Dropout)         (None, 31)                0         
_________________________________________________________________
dense_80 (Dense)             (None, 150)               4800      
_________________________________________________________________
dropout_81 (Dropout)         (None, 150)               0         
_________________________________________________________________
dense_81 (Dense)             (None, 80)                12080     
_________________________________________________________________
dropout_82 (Dropout)         (None, 80)                0         
_________________________________________________________________
dense_82 (Dense)             (None, 15)                1215      
_________________________________________________________________
dropout_83 (Dropout)         (None, 15)                0         
_________________________________________________________________
dense_83 (Dense)             (None, 5)                 80        
_________________________________________________________________
dropout_84 (Dropout)         (None, 5)                 0         
_________________________________________________________________
dense_84 (Dense)             (None, 1)                 6         
=================================================================
Total params: 18,181
Trainable params: 18,181
Non-trainable params: 0
_________________________________________________________________
