
 Model Name: DNN_mymod2 
 Number of periods: 17 
 Number of nodes: [150, 50, 10, 5] 
 
Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dropout_80 (Dropout)         (None, 31)                0         
_________________________________________________________________
dense_80 (Dense)             (None, 150)               4800      
_________________________________________________________________
dropout_81 (Dropout)         (None, 150)               0         
_________________________________________________________________
dense_81 (Dense)             (None, 50)                7550      
_________________________________________________________________
dropout_82 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_82 (Dense)             (None, 10)                510       
_________________________________________________________________
dropout_83 (Dropout)         (None, 10)                0         
_________________________________________________________________
dense_83 (Dense)             (None, 5)                 55        
_________________________________________________________________
dropout_84 (Dropout)         (None, 5)                 0         
_________________________________________________________________
dense_84 (Dense)             (None, 1)                 6         
=================================================================
Total params: 12,921
Trainable params: 12,921
Non-trainable params: 0
_________________________________________________________________
