
 Model Name: DNN_paper_pca 
 Number of periods: 17 
 Number of nodes: [31, 15, 10, 5] 
 
Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dropout_80 (Dropout)         (None, 31)                0         
_________________________________________________________________
dense_80 (Dense)             (None, 31)                992       
_________________________________________________________________
dropout_81 (Dropout)         (None, 31)                0         
_________________________________________________________________
dense_81 (Dense)             (None, 15)                480       
_________________________________________________________________
dropout_82 (Dropout)         (None, 15)                0         
_________________________________________________________________
dense_82 (Dense)             (None, 10)                160       
_________________________________________________________________
dropout_83 (Dropout)         (None, 10)                0         
_________________________________________________________________
dense_83 (Dense)             (None, 5)                 55        
_________________________________________________________________
dropout_84 (Dropout)         (None, 5)                 0         
_________________________________________________________________
dense_84 (Dense)             (None, 1)                 6         
=================================================================
Total params: 1,693
Trainable params: 1,693
Non-trainable params: 0
_________________________________________________________________
