
 Model Name: CNN_dense_pca_wave 
 Number of periods: 17 
 Number of filters in conv layers: 8 
 
Model: "model_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_17 (InputLayer)        [(None, 240, 3)]          0         
_________________________________________________________________
dropout_32 (Dropout)         (None, 240, 3)            0         
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 45, 8)             488       
_________________________________________________________________
max_pooling1d_16 (MaxPooling (None, 41, 8)             0         
_________________________________________________________________
dropout_33 (Dropout)         (None, 41, 8)             0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 328)               0         
_________________________________________________________________
dense_32 (Dense)             (None, 25)                8225      
_________________________________________________________________
dense_33 (Dense)             (None, 1)                 26        
=================================================================
Total params: 8,739
Trainable params: 8,739
Non-trainable params: 0
_________________________________________________________________
