
 Model Name: LSTM_Model4
 Number of periods: 17
 Number of nodes: [25]
 Optimizier: Adam
PCA + Wavelet: True

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dropout (Dropout)            (None, 240, 4)            0
_________________________________________________________________
lstm (LSTM)                  (None, 25)                3000
_________________________________________________________________
dropout_1 (Dropout)          (None, 25)                0
_________________________________________________________________
dense (Dense)                (None, 1)                 26
=================================================================
Total params: 3,026
Trainable params: 3,026
Non-trainable params: 0
_________________________________________________________________
