
 Model Name: LSTM_Model1

 Number of periods: 17

 Number of nodes: [25]

 Optimizier: RMS_prop

 PCA + Wavelet: False

 Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dropout (Dropout)            (None, 240, 1)            0
_________________________________________________________________
lstm (LSTM)                  (None, 25)                2700
_________________________________________________________________
dropout_1 (Dropout)          (None, 25)                0
_________________________________________________________________
dense (Dense)                (None, 1)                 26
=================================================================
Total params: 2,726
Trainable params: 2,726
Non-trainable params: 0
_________________________________________________________________
