
 Model Name: CNN_minpool 
 Number of periods: 17 
 Number of filters in conv layers: 8 
 
Model: "model_16"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_17 (InputLayer)           [(None, 240, 1)]     0                                            
__________________________________________________________________________________________________
dropout_32 (Dropout)            (None, 240, 1)       0           input_17[0][0]                   
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 45, 8)        168         dropout_32[0][0]                 
__________________________________________________________________________________________________
tf.math.negative_32 (TFOpLambda (None, 45, 8)        0           conv1d_16[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_33 (MaxPooling1D) (None, 41, 8)        0           tf.math.negative_32[0][0]        
__________________________________________________________________________________________________
tf.math.negative_33 (TFOpLambda (None, 41, 8)        0           max_pooling1d_33[0][0]           
__________________________________________________________________________________________________
max_pooling1d_32 (MaxPooling1D) (None, 41, 8)        0           conv1d_16[0][0]                  
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, 41, 16)       0           tf.math.negative_33[0][0]        
                                                                 max_pooling1d_32[0][0]           
__________________________________________________________________________________________________
dropout_33 (Dropout)            (None, 41, 16)       0           concatenate_16[0][0]             
__________________________________________________________________________________________________
flatten_16 (Flatten)            (None, 656)          0           dropout_33[0][0]                 
__________________________________________________________________________________________________
dense_32 (Dense)                (None, 25)           16425       flatten_16[0][0]                 
__________________________________________________________________________________________________
dense_33 (Dense)                (None, 1)            26          dense_32[0][0]                   
==================================================================================================
Total params: 16,619
Trainable params: 16,619
Non-trainable params: 0
__________________________________________________________________________________________________
