
 Model Name: DNN_mymod2_pca 
 Number of periods: 10 
 Number of nodes: [150, 50, 10, 5] 
 
Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dropout_45 (Dropout)         (None, 31)                0         
_________________________________________________________________
dense_45 (Dense)             (None, 150)               4800      
_________________________________________________________________
dropout_46 (Dropout)         (None, 150)               0         
_________________________________________________________________
dense_46 (Dense)             (None, 50)                7550      
_________________________________________________________________
dropout_47 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_47 (Dense)             (None, 10)                510       
_________________________________________________________________
dropout_48 (Dropout)         (None, 10)                0         
_________________________________________________________________
dense_48 (Dense)             (None, 5)                 55        
_________________________________________________________________
dropout_49 (Dropout)         (None, 5)                 0         
_________________________________________________________________
dense_49 (Dense)             (None, 1)                 6         
=================================================================
Total params: 12,921
Trainable params: 12,921
Non-trainable params: 0
_________________________________________________________________
