
 Model Name: DNN_paper_auto 
 Number of periods: 1 
 Number of nodes: [31, 15, 10, 5] 
 
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dropout (Dropout)            (None, 31)                0         
_________________________________________________________________
dense (Dense)                (None, 31)                992       
_________________________________________________________________
dropout_1 (Dropout)          (None, 31)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 15)                480       
_________________________________________________________________
dropout_2 (Dropout)          (None, 15)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                160       
_________________________________________________________________
dropout_3 (Dropout)          (None, 10)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 55        
_________________________________________________________________
dropout_4 (Dropout)          (None, 5)                 0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 6         
=================================================================
Total params: 1,693
Trainable params: 1,693
Non-trainable params: 0
_________________________________________________________________
