
 Model Name: CNN_dense+ 
 Number of periods: 17 
 Number of filters in conv layers: 15 
 
Model: "model_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_17 (InputLayer)        [(None, 240, 1)]          0         
_________________________________________________________________
dropout_32 (Dropout)         (None, 240, 1)            0         
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 45, 15)            315       
_________________________________________________________________
max_pooling1d_16 (MaxPooling (None, 41, 15)            0         
_________________________________________________________________
dropout_33 (Dropout)         (None, 41, 15)            0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 615)               0         
_________________________________________________________________
dense_32 (Dense)             (None, 25)                15400     
_________________________________________________________________
dense_33 (Dense)             (None, 1)                 26        
=================================================================
Total params: 15,741
Trainable params: 15,741
Non-trainable params: 0
_________________________________________________________________
